let userUPNs = UrlClickEvents
| where Timestamp > ago(24h)
| distinct AccountUpn;
AADSignInEventsBeta
| where Timestamp > ago(24h) 
| where RiskLevelDuringSignIn > 1 or RiskLevelAggregated > 1
| where IsCompliant == 0
| extend AccountUpn = tolower(AccountUpn)
| where AccountUpn in (userUPNs)
| distinct  Application, LogonType, AccountDisplayName, AccountUpn, IPAddress, Country, State, City, ErrorCode, RiskLevelDuringSignIn, RiskLevelAggregated, RiskEventTypes
