AADSignInEventsBeta 
| where Timestamp > ago(30d) and ErrorCode == 0 and Application <> 'Microsoft Authentication Broker'
| where RiskLevelDuringSignIn in (50,100) and RiskState == 2
| extend Day = startofday(Timestamp)
| summarize
    ['Total Medium Risk Count']=countif(RiskLevelDuringSignIn == 50),
    ['Total High Risk Count']=countif(RiskLevelDuringSignIn == 100) by Day  
