//this can be ran in Defender threat hunting
//Possible successfull password spray against Azure AD Connect endpoint
AADSignInEventsBeta 
| where ApplicationId == 'cb1056e2-e479-49de-ae31-7812af012ed8'
| where ErrorCode !in (50126,50053)
//| where AccountUpn !contains "sync_"
| where NetworkLocationDetails !has "trustedNamedLocation"
| project Timestamp,Application, AccountDisplayName, AccountUpn,ErrorCode, IPAddress, Country, RiskLevelDuringSignIn, RiskLevelAggregated, RiskEventTypes
