AADSignInEventsBeta 
| where ApplicationId == 'cb1056e2-e479-49de-ae31-7812af012ed8'
| where ErrorCode !in (50126,50053)
| where AccountUpn !contains "sync_"
| project Application, AccountDisplayName, AccountUpn,ErrorCode, IPAddress, Country, RiskLevelDuringSignIn, RiskLevelAggregated, RiskEventTypes
