AADSignInEventsBeta 
| where Timestamp >= ago(15d)
| where ErrorCode in (50126,50076,50053)
| where NetworkLocationDetails !has "trustedNamedLocation"
| summarize badpwdcount = count() by startofday(Timestamp)
