//currently set to query 7 days
SigninLogs
| where TimeGenerated > ago(7d) and ResultType == 0
| where AADTenantId == ResourceTenantId
| where AppDisplayName  <> "Windows Sign In" and AppDisplayName <> "Microsoft Authentication Broker"
| extend TrustedLocation = tostring(iff(NetworkLocationDetails contains 'trustedNamedLocation', 'trustedNamedLocation','')) 
| extend networkName = tostring(parse_json(parse_json(NetworkLocationDetails)[0].networkNames)[0])
| summarize applications=make_set(AppDisplayName) by UserPrincipalName, TrustedLocation, Location, ConditionalAccessStatus, networkName, UserType
