let signedin = AADNonInteractiveUserSignInLogs | union SigninLogs | where TimeGenerated > ago(90d) and ResultType == 0 | distinct UserPrincipalName;
IdentityInfo 
| where TimeGenerated > ago(14d)
| extend signedIn = tostring(iff(AccountUPN in (signedin), 'Active','Inactive'))
| distinct  AccountUPN, signedIn, UserType
| project AccountUPN, UserType, signedIn
