//replace "changeme" with the users accountname.  The results will show the machine that is being logged
//into.
let user = "changeme";
IdentityLogonEvents 
| where ActionType == "LogonFailed"
| where Application == "Active Directory"
| where AccountName has (user)
| extend TargetOS = tostring(parse_json(AdditionalFields.TargetComputerOperatingSystem))
| project AccountDisplayName,AccountName, AccountDomain, AccountUpn, ActionType, FailureReason,TargetDeviceName,TargetOS, DeviceName
