IdentityLogonEvents
| where Application == "Active Directory" 
| extend SourceComputerSid = tostring(parse_json(AdditionalFields.SourceComputerSid))
| extend SourceComputerObjectGuid = tostring(parse_json(AdditionalFields.SourceComputerObjectGuid))
| extend SourceComputerOperatingSystem = tostring(parse_json(AdditionalFields.SourceComputerOperatingSystem))
| distinct SourceComputerSid, SourceComputerObjectGuid, SourceComputerOperatingSystem
| summarize count() by SourceComputerOperatingSystem
