//This gets the daily total of bad password attempts from on premise active directory, this filters out computer objects to just focus on user objects
IdentityLogonEvents 
| where FailureReason == "WrongPassword"
| where AccountName !has "$"
| where Application == "Active Directory"
| summarize daileybadpassword =  count() by startofday(Timestamp)
| sort by Timestamp desc 
