IdentityLogonEvents 
| where FailureReason == "WrongPassword"
| where AccountName !has "$"
| where Application == "Active Directory"
| summarize hourlybadpassword =  count() by bin(Timestamp,1h) 
| where hourlybadpassword > 20000
| sort by Timestamp desc 
