IdentityLogonEvents 
| where FailureReason == "WrongPassword"
| where AccountName !has "$"
| where Application == "Active Directory"
| summarize totalbadpassword =  count() by DeviceName
| sort by totalbadpassword  desc 
